app/controllers/card_controller.rb

    def new
        @card = Card.new
        @list = List.find_by(id: params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @card = Card.new(card_params)
        if @card.save
---
INSERT INTO "cards" ("title", "memo", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["memo", "aaa"], ["list_id", 5], ["created_at", "2020-02-10 13:25:51.313833"], ["updated_at", "2020-02-10 13:25:51.313833"]]

    def edit
        #　@card = Card.find_by(id: params[:id])の記述が、show,edit,updateメソッドで重複しているので、set_cardに処理をまとめる
        #　@card = Card.find_by(id: params[:id])
        #　ここでログインユーザーの作成したListの情報を取得する
        @lists = List.where(user: current_user)
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 2]]

    def update
        #　@card = Card.find_by(id: params[:id])の記述が、show,edit,updateメソッドで重複しているので、set_cardに処理をまとめる
        #@card = Card.find_by(id: params[:id])
        if @card.update_attributes(card_params)
---
UPDATE "cards" SET "list_id" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["list_id", 2], ["updated_at", "2020-02-09 09:08:16.688375"], ["id", 3]]

    def destroy
        @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 5]]

        def set_card
            #　@card = Card.find_by(id: params[:id])の記述が、show,edit,updateメソッドで重複しているので、set_cardに処理をまとめる
            @card = Card.find_by(id: params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]