app/controllers/list_controller.rb

    def create
        @list = List.new(list_params)
        if @list.save
---
INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "家事"], ["user_id", 2], ["created_at", "2020-02-03 07:50:55.614376"], ["updated_at", "2020-02-03 07:50:55.614376"]]

    def update
        # @list = List.find_by(id: params[:id]) 下記set_listにて省略
        # update_attributesで成功時には更新と保存を続けて同時に行う
        if @list.update_attributes(list_params)
---
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "大学の課"], ["updated_at", "2020-02-02 08:47:10.703868"], ["id", 1]]

        def set_list
            @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]